# BaseExportOptions Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BaseExportOptions Properties
BaseExportOptions Class See Also
---
The BaseExportOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Colors | Export color mode. Default value is ExportColorMode.IndexColors. |
| HatchPatternsFileName | Custom hatch patterns (pat) file name. |
| HideReferencePlane | Whether or not to hide reference planes. Default value is false. |
| HideScopeBox | Whether or not to hide the scope box. Default value is false. |
| HideUnreferenceViewTags | Whether or not to hide unreference view tags. Default value is false. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LayerMapping | Name of a layer settings standard or filename (with custom layer settings). Valid standards are: DGNV7 (only for DGN), AIA, CP83, BS1192, and ISO13567. default value is "" (empty) which means if no value is set, if no value is set, Revit will use a default value according to the localization. |
| PreserveCoincidentLines | Whether or not to preserve coincident lines. Default value is false. |
| PropOverrides | How to export overridden object styles. Default value is PropOverrideMode.ByEntity. |

# See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace